In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries_1985to2018.csv')

In [3]:
df.head()

,league,player_id,salary,season,season_end,season_start,team
0,NBA,abdelal01,395000,1990-91,1991,1990,Portland Trail Blazers
1,NBA,abdelal01,494000,1991-92,1992,1991,Portland Trail Blazers
2,NBA,abdelal01,500000,1992-93,1993,1992,Boston Celtics
3,NBA,abdelal01,805000,1993-94,1994,1993,Boston Celtics
4,NBA,abdelal01,650000,1994-95,1995,1994,Sacramento Kings

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14163 entries, 0 to 14162
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   league        14163 non-null  object
 1   player_id     14163 non-null  object
 2   salary        14163 non-null  int64
 3   season        14163 non-null  object
 4   season_end    14163 non-null  int64
 5   season_start  14163 non-null  int64
 6   team          14159 non-null  object
dtypes: int64(3), object(4)
memory usage: 774.7+ KB

In [5]:
df.describe()

             salary   season_end  season_start
count  1.416300e+04  14163.00000   14163.00000
mean   3.164870e+06   2003.66942    2002.66942
std    4.185046e+06      9.16469       9.16469
min    2.706000e+03   1985.00000    1984.00000
25%    6.300000e+05   1996.00000    1995.00000
50%    1.500000e+06   2004.00000    2003.00000
75%    3.884239e+06   2012.00000    2011.00000
max    3.468255e+07   2018.00000    2017.00000

In [6]:
print(df.isnull().sum())

league          0
player_id       0
salary          0
season          0
season_end      0
season_start    0
team            4
dtype: int64

In [7]:
df_cleaned = df.dropna()

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14163 entries, 0 to 14162
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   league        14163 non-null  object
 1   player_id     14163 non-null  object
 2   salary        14163 non-null  int64
 3   season        14163 non-null  object
 4   season_end    14163 non-null  int64
 5   season_start  14163 non-null  int64
 6   team          14159 non-null  object
dtypes: int64(3), object(4)
memory usage: 774.7+ KB

In [9]:
print(df.dtypes)

league          object
player_id       object
salary           int64
season          object
season_end       int64
season_start     int64
team            object
dtype: object

In [10]:
df.to_csv("salaries_analysis.csv", index=False)